/* Copyright 2008 CogniTom Academic Design & Tsutomu Kawamura
 * http://jsmap.cognitom.com/
 * office@cognitom.com
 *
 * jsmap 0.9.5
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

// ** I18N Japan
var mapDataLocale = 'ja';
var mapData = [
	{
		'name':'東北-北海道',
		'line':[107,10,107],
		'data':[
			['北海道','北海道',58,67,119,26],
			['青森','青森県',53,22,40,5],
			['岩手','岩手県',34,32,59,29],
			['秋田','秋田県',32,32,25,29],
			['宮城','宮城県',30,26,37,63],
			['山形','山形県',30,26,5,63],
			['福島','福島県',45,23,5,91]
		],
		'order':['北海道','青森','岩手','秋田','宮城','山形','福島']//カーソル移動順
	},
	{
		'name':'関東-中部',
		'line':false,
		'data':[
			['新潟','新潟県',61,25,72,4],
			['長野','長野県',44,56,58,31,-16],
			['富山','富山県',25,21,45,18],
			['石川','石川県',17,29,26,10,0,true],
			['岐阜','岐阜県',30,42,26,41,8],
			['福井','福井県',28,16,6,41],
			['茨城','茨城県',42,27,135,46,11],
			['栃木','栃木県',25,24,135,31],
			['群馬','群馬県',29,24,104,31],
			['千葉','千葉県',27,38,135,73],
			['埼玉','埼玉県',29,17,104,57],
			['東京','東京都',29,14,104,76],
			['山梨','山梨県',20,25,82,65],
			['神奈川','神奈川県',46,14,82,92],
			['静岡','静岡県',22,21,58,89],
			['愛知','愛知県',25,16,31,85],
			['三重','三重県',20,31,9,85,0,true]
		],
		'order':['栃木','茨城','千葉','新潟','群馬','埼玉','東京','山梨','神奈川','長野','静岡','富山','石川','福井','岐阜','愛知','三重']//カーソル移動順
	},
	{
		'name':'近畿-中国-四国',
		'line':false,
		'data':[
			['滋賀','滋賀県',18,28,160,26,0,true],
			['京都','京都府',18,35,140,19,0,true],
			['和歌山','和歌山県',39,29,122,75,10],
			['奈良','奈良県',15,31,146,56,0,true],
			['兵庫','兵庫県',25,35,113,19],
			['大阪','大阪府',22,17,122,56],
			['鳥取','鳥取県',33,14,78,19],
			['岡山','岡山県',33,19,78,35],
			['香川','香川県',33,13,78,61],
			['徳島','徳島県',33,20,78,76],
			['島根','島根県',48,19,28,19,-4],
			['広島','広島県',37,19,39,35],
			['愛媛','愛媛県',43,22,33,70,-6],
			['高知','高知県',38,18,44,86],
			['山口','山口県',33,21,4,40]
		],
		'order':['滋賀','京都','奈良','和歌山','兵庫','大阪','鳥取','岡山','香川','徳島','島根','広島','愛媛','高知','山口']//カーソル移動順
	},
	{
		'name':'九州-沖縄',
		'line':[67,11,107],
		'data':[
			['長崎','長崎県',16,34,77,10,0,true],
			['佐賀','佐賀県',22,20,95,10],
			['福岡','福岡県',23,27,119,10,-8],
			['大分','大分県',27,29,133,30],
			['宮崎','宮崎県',30,41,126,61,8],
			['鹿児島','鹿児島県',30,34,94,79],
			['熊本','熊本県',28,38,103,39],
			['沖縄','沖縄県',28,15,24,57]
		],
		'order':['福岡','大分','宮崎','佐賀','熊本','鹿児島','長崎','沖縄']//カーソル移動順
	}
];